Комплексная_автоматизация_2_МОМ_2019/src/Documents/ВводВыводДенежныхСредствПоНаправлению/ВводВыводДенежныхСредствПоНаправлению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводВыводДенежныхСредствПоНаправлению</name>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <attributes>
    <name>НаправлениеОтправитель</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПолучатель</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Комплексная_автоматизация_2_МОМ_2019/src/Documents/ВводВыводДенежныхСредствПоНаправлению/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаПрочиеАктивыПассивы(ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата                   КАК Период,
	|	ДанныеДокумента.НаправлениеОтправитель КАК НаправлениеОтправитель,
	|	ДанныеДокумента.НаправлениеПолучатель  КАК НаправлениеПолучатель,
	|	ДанныеДокумента.Ответственный          КАК Ответственный
	|
	|ИЗ
	|	Документ.ВводВыводДенежныхСредствПоНаправлению КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета",        Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",            Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ИспользоватьУчетПрочихДоходовРасходов", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов"));
	Запрос.УстановитьПараметр("ПустоеНаправление",                     Справочники.НаправленияДеятельности.ПустаяСсылка());
	
КонецПроцедуры

Функция ТекстЗапросаПрочиеАктивыПассивы(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеАктивыПассивы";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"// Расход косвенных денежных средств направления
	|ВЫБРАТЬ
	|	&Период                                КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО                           КАК Организация,
	|	НЕОПРЕДЕЛЕНО                           КАК Подразделение,
	|	ДанныеДокумента.НаправлениеОтправитель КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ДенежныеСредстваНаправления) КАК Статья,
	|	НЕОПРЕДЕЛЕНО                           КАК Аналитика,
	|
	|	ДанныеДокумента.Сумма                  КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыИсточниковДвижений.ПустаяСсылка) КАК ВидИсточника,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникиУправленческогоБаланса.ПустаяСсылка) КАК Источник
	|
	|ИЗ
	|	Документ.ВводВыводДенежныхСредствПоНаправлению КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Вывод собственных средств из направления
	|ВЫБРАТЬ
	|	&Период                                КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО                           КАК Организация,
	|	НЕОПРЕДЕЛЕНО                           КАК Подразделение,
	|	ДанныеДокумента.НаправлениеОтправитель КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВыводСобственныхСредств) КАК Статья,
	|	НЕОПРЕДЕЛЕНО                           КАК Аналитика,
	|
	|	ДанныеДокумента.Сумма                  КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыИсточниковДвижений.ПустаяСсылка) КАК ВидИсточника,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникиУправленческогоБаланса.ПустаяСсылка) КАК Источник
	|
	|ИЗ
	|	Документ.ВводВыводДенежныхСредствПоНаправлению КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Приход косвенных денежных средств направления
	|ВЫБРАТЬ
	|	&Период                                КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО                           КАК Организация,
	|	НЕОПРЕДЕЛЕНО                           КАК Подразделение,
	|	ДанныеДокумента.НаправлениеПолучатель  КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ДенежныеСредстваНаправления) КАК Статья,
	|	НЕОПРЕДЕЛЕНО                           КАК Аналитика,
	|
	|	ДанныеДокумента.Сумма                  КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыИсточниковДвижений.ПустаяСсылка) КАК ВидИсточника,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникиУправленческогоБаланса.ПустаяСсылка) КАК Источник
	|
	|ИЗ
	|	Документ.ВводВыводДенежныхСредствПоНаправлению КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Ввод собственных средств в направлене
	|ВЫБРАТЬ
	|	&Период                                КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО                           КАК Организация,
	|	НЕОПРЕДЕЛЕНО                           КАК Подразделение,
	|	ДанныеДокумента.НаправлениеПолучатель  КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВложенияСобственныхСредств) КАК Статья,
	|	НЕОПРЕДЕЛЕНО                           КАК Аналитика,
	|
	|	ДанныеДокумента.Сумма                  КАК Сумма,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыИсточниковДвижений.ПустаяСсылка) КАК ВидИсточника,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникиУправленческогоБаланса.ПустаяСсылка) КАК Источник
	|
	|ИЗ
	|	Документ.ВводВыводДенежныхСредствПоНаправлению КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
